practica/app/controllers/autos_controller.rb

SELECT "autos".* FROM "autos"
---
    def index
        @autos=Auto.all

INSERT INTO "autos" ("nombre", "modelo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nombre", "Hilux"], ["modelo", 2016], ["created_at", "2019-08-12 18:42:30.223373"], ["updated_at", "2019-08-12 18:42:30.223373"]]
---
    def create
	@auto= Auto.create!(autos_params)

SELECT  "autos".* FROM "autos" WHERE "autos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def custom
	    @auto=Auto.find(params[:id])