practica/app/controllers/gokus_controller.rb

	def index
	  @gokus = Goku.all
---
SELECT "gokus".* FROM "gokus"

	def create
	  @goku = Goku.create!(goku_params)
---
INSERT INTO "gokus" ("hijo", "fase", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["hijo", "gohan"], ["fase", "sueper sayayin"], ["created_at", "2019-08-12 01:59:10.658502"], ["updated_at", "2019-08-12 01:59:10.658502"]]

	def show
       	  @goku = Goku.find(params[:id])
---
SELECT  "gokus".* FROM "gokus" WHERE "gokus"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def destroy
	  @goku = Goku.find(params[:id])
          @goku.destroy
---
SELECT  "gokus".* FROM "gokus" WHERE "gokus"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "gokus" WHERE "gokus"."id" = ?  [["id", 2]]

	def custom
	  @goku = Goku.find(params[:id])
---
SELECT  "gokus".* FROM "gokus" WHERE "gokus"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]