practica/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def custom
   @user= User.find(params[:id])

INSERT INTO "users" ("nombre", "edad", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nombre", "Anthony"], ["edad", 19], ["created_at", "2019-08-12 00:00:06.558906"], ["updated_at", "2019-08-12 00:00:06.558906"]]
---
  def create
    @users = User.create!(users_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
   @users= User.find(params[:id])