examen/app/controllers/zapatos_controller.rb

  def index
    @zapatos = Zapato.all
---
SELECT "zapatos".* FROM "zapatos"

  def create
    @zapato = Zapato.create!(zapato_params)
---
INSERT INTO "zapatos" ("tipo", "tamano", "material", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["tipo", "zapatilla"], ["tamano", 9], ["material", "cuero"], ["created_at", "2019-08-13 23:59:08.094259"], ["updated_at", "2019-08-13 23:59:08.094259"]]

  def set_zapato
    @zapato = Zapato.find(params[:id])
---
SELECT  "zapatos".* FROM "zapatos" WHERE "zapatos"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]