proyecto/app/controllers/detalles_controller.rb

  def create
    @medico.detalles.create!(detalle_params)
---
INSERT INTO "detalles" ("medico_id", "especialidad", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["medico_id", 2], ["especialidad", "oftamologo"], ["created_at", "2019-07-23 20:16:13.067122"], ["updated_at", "2019-07-23 20:16:13.067122"]]

  def set_pharmacy
  @pharmacy = Pharmacy.find(params[:pharmacy_id])
  @medico = @pharmacy.medicos.find_by!(id: params[:medico_id]) if @pharmacy
---
SELECT  "pharmacies".* FROM "pharmacies" WHERE "pharmacies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "medicos".* FROM "medicos" WHERE "medicos"."pharmacy_id" = ? AND "medicos"."id" = ? LIMIT ?  [["pharmacy_id", 2], ["id", 4], ["LIMIT", 1]]

  def set_pharmacy_detalle
  @detalle = @medico.detalles.find_by!(id: params[:id]) if @pharmacy
---
SELECT "detalles".* FROM "detalles" WHERE "detalles"."medico_id" = ?  [["medico_id", 1]]