proyecto/app/controllers/drugstores_controller.rb

SELECT "drugstores".* FROM "drugstores"
---
  def index
    @drugstores = Drugstore.all

INSERT INTO "drugstores" ("nombre", "created_at", "updated_at") VALUES (?, ?, ?)  [["nombre", "Mi foldercito tu pito pendeja"], ["created_at", "2019-07-23 01:32:26.078134"], ["updated_at", "2019-07-23 01:32:26.078134"]]
---
  def create
    @name_drugstore=drugstore_params
    @name_drugstore[:name]=@name_drugstore[:name][0..14]
    puts @name_drugstore
    @drugstore = Drugstore.create!(@name_drugstore)

SELECT  "drugstores".* FROM "drugstores" WHERE "drugstores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def filter_drugs
    @drug=params.permit(:drug)  #Aqui es donde obtenemos el input del usuario, variable la cual aplicara el filtro
    @temp_drugstore = Drugstore.find(params[:drugstore_id])  #farmacia temporal la cual manipularemos

SELECT  "drugstores".* FROM "drugstores" WHERE "drugstores"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_drugstore
    @drugstore = Drugstore.find(params[:id])