proyecto/app/controllers/facturas_vacunas_controller.rb

  def index
    @facturas_vacuna = Factura_Vacuna.all
---
SELECT "factura_vacunas".* FROM "factura_vacunas"

  def set_factura_vacuna
    @factura_vacuna = Factura_Vacuna.find(params[:id])
---
SELECT  "factura_vacunas".* FROM "factura_vacunas" WHERE "factura_vacunas"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]