proyecto/app/controllers/illnesses_controller.rb

  def create
    @vaccine.illnesses.create!(illness_params)
---
INSERT INTO "illnesses" ("vaccine_id", "nombre", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["vaccine_id", 1], ["nombre", "Gripe"], ["created_at", "2019-07-23 02:27:35.790598"], ["updated_at", "2019-07-23 02:27:35.790598"]]

  def set_drugstore
    @drugstore = Drugstore.find_by!(id: params[:drugstore_id])
    @vaccine = @drugstore.vaccines.find_by!(id: params[:vaccine_id]) if @drugstore
---
SELECT  "drugstores".* FROM "drugstores" WHERE "drugstores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "vaccines".* FROM "vaccines" WHERE "vaccines"."drugstore_id" = ? AND "vaccines"."id" = ? LIMIT ?  [["drugstore_id", 1], ["id", 1], ["LIMIT", 1]]

  def set_illness
    @illness =  @vaccine.illnesses.find_by!(id: params[:id]) if @vaccine
---
SELECT "illnesses".* FROM "illnesses" WHERE "illnesses"."vaccine_id" = ?  [["vaccine_id", 1]]