proyecto/app/controllers/medicos_controller.rb

  def create
    @pharmacy.medicos.create!(medico_params)
---
INSERT INTO "medicos" ("pharmacy_id", "nombre", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["pharmacy_id", 1], ["nombre", "Alonso"], ["created_at", "2019-07-23 20:14:40.934044"], ["updated_at", "2019-07-23 20:14:40.934044"]]

  def set_pharmacy
    @pharmacy = Pharmacy.find(params[:pharmacy_id])
---
SELECT  "pharmacies".* FROM "pharmacies" WHERE "pharmacies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_pharmacy_medico
    @medico = @pharmacy.medicos.find_by!(id: params[:id]) if @pharmacy
---
SELECT  "medicos".* FROM "medicos" WHERE "medicos"."pharmacy_id" = ? AND "medicos"."id" = ? LIMIT ?  [["pharmacy_id", 1], ["id", 1], ["LIMIT", 1]]