proyecto/app/controllers/pharmacies_controller.rb

SELECT "pharmacies".* FROM "pharmacies"
---
  def index
    @pharmacy = Pharmacy.all

INSERT INTO "pharmacies" ("nombre", "created_at", "updated_at") VALUES (?, ?, ?)  [["nombre", "la bomba"], ["created_at", "2019-07-22 17:14:35.592039"], ["updated_at", "2019-07-22 17:14:35.592039"]]
---
  def create
    @pharmacy = Pharmacy.create!(pharmacy_params)

SELECT  "pharmacies".* FROM "pharmacies" WHERE "pharmacies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "detalles" WHERE "detalles"."medico_id" = ? AND "detalles"."especialidad" = ? LIMIT ?  [["medico_id", 1], ["especialidad", "cardiologo"], ["LIMIT", 1]]
---
  def filtro
    @detalle=params.permit(:detalle)
    @temp_pharmacy = Pharmacy.find_by!(id: params[:pharmacy_id])
    @result=[]
    for medico in @temp_pharmacy.medicos do
	 @result.push(medico) if medico.detalles.exists?(especialidad: params[:detalle])