proyecto/app/controllers/pharmacy_controller.rb

  def index
    @Pharmacies = Pharmacy.all
---
SELECT "pharmacies".* FROM "pharmacies"