proyecto/app/controllers/vaccines_controller.rb

INSERT INTO "vaccines" ("drugstore_id", "dosis", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["drugstore_id", 1], ["dosis", 2], ["created_at", "2019-07-23 01:36:31.559674"], ["updated_at", "2019-07-23 01:36:31.559674"]]
---
  def create
    @drugstore.vaccines.create!(vaccine_params)

DELETE FROM "vaccines" WHERE "vaccines"."id" = ?  [["id", 1]]
---
  def destroy
    @vaccine.destroy

SELECT  "drugstores".* FROM "drugstores" WHERE "drugstores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_drugstore
    @drugstore = Drugstore.find(params[:drugstore_id])

SELECT  "vaccines".* FROM "vaccines" WHERE "vaccines"."drugstore_id" = ? AND "vaccines"."id" = ? LIMIT ?  [["drugstore_id", 1], ["id", 0], ["LIMIT", 1]]
---
  def set_drugstore_vaccine
    @vaccine = @drugstore.vaccines.find_by!(id: params[:id]) if @drugstore