my-api/app/controllers/facturas_controller.rb

  def index
    @facturas = Factura.all
---
SELECT "facturas".* FROM "facturas"

  def create
    @factura = Factura.create!(factura_params)
---
INSERT INTO "facturas" ("titulo", "creada_por", "fecha", "total", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["titulo", "diario"], ["creada_por", "juanito"], ["fecha", "2019-06-25"], ["total", 0], ["created_at", "2019-06-26 01:20:37.952388"], ["updated_at", "2019-06-26 01:20:37.952388"]]

  def update
    @factura.update(factura_params)
---
UPDATE "facturas" SET "creada_por" = ?, "updated_at" = ? WHERE "facturas"."id" = ?  [["creada_por", "Peter Pan"], ["updated_at", "2019-06-22 22:17:19.293531"], ["id", 1]]

  def destroy
    @factura.destroy
---
DELETE FROM "facturas" WHERE "facturas"."id" = ?  [["id", 2]]

  def set_factura
    @factura = Factura.find(params[:id])
---
SELECT  "facturas".* FROM "facturas" WHERE "facturas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]