my-api/app/controllers/productos_controller.rb

  def set_factura
    @factura = Factura.find(params[:factura_id])
---
SELECT  "facturas".* FROM "facturas" WHERE "facturas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]