my-api/app/controllers/productos_controller.rb

  def create
    @producto_temp = @factura.productos.find_by(nombre: producto_params[:nombre])


    if @producto_temp.nil?
	    @factura.productos.create!(producto_params)
    else
	    @producto_temp[:cantidad] = @producto_temp[:cantidad] + producto_params[:cantidad].to_i
	    @producto_temp[:precio] = producto_params[:precio]
	    @producto_temp.save
---
SELECT  "productos".* FROM "productos" WHERE "productos"."factura_id" = ? AND "productos"."nombre" = ? LIMIT ?  [["factura_id", 1], ["nombre", "RAM"], ["LIMIT", 1]]
INSERT INTO "productos" ("factura_id", "nombre", "cantidad", "precio", "created_at", "updated_at", "activo") VALUES (?, ?, ?, ?, ?, ?, ?)  [["factura_id", 3], ["nombre", "banano"], ["cantidad", 2], ["precio", 100], ["created_at", "2019-06-26 01:25:42.408344"], ["updated_at", "2019-06-26 01:25:42.408344"], ["activo", 1]]
UPDATE "facturas" SET "total" = ?, "updated_at" = ? WHERE "facturas"."id" = ?  [["total", 90000], ["updated_at", "2019-06-22 22:27:30.342182"], ["id", 1]]
UPDATE "productos" SET "precio" = ?, "updated_at" = ? WHERE "productos"."id" = ?  [["precio", 2000], ["updated_at", "2019-06-26 01:01:57.513257"], ["id", 1]]

  def update
    @producto.update(producto_params)
---
UPDATE "productos" SET "activo" = ?, "updated_at" = ? WHERE "productos"."id" = ?  [["activo", 0], ["updated_at", "2019-06-26 01:28:49.318011"], ["id", 5]]

  def destroy
    @producto.destroy
---
DELETE FROM "productos" WHERE "productos"."id" = ?  [["id", 2]]

  def set_factura
    @factura = Factura.find(params[:factura_id])
---
SELECT  "facturas".* FROM "facturas" WHERE "facturas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_factura_producto
    @producto = @factura.productos.find_by!(id: params[:id]) if @factura
---
SELECT  "productos".* FROM "productos" WHERE "productos"."factura_id" = ? AND "productos"."id" = ? LIMIT ?  [["factura_id", 1], ["id", 1], ["LIMIT", 1]]

  def set_factura_total
    @factura_sub_total = 0

    @factura.productos.each do |producto|
      @factura_sub_total = @factura_sub_total + (producto.cantidad * producto.precio)
    end
    @factura.total = @factura_sub_total

    @factura = @factura.save
---
SELECT "productos".* FROM "productos" WHERE "productos"."factura_id" = ?  [["factura_id", 3]]
UPDATE "productos" SET "created_at" = ?, "updated_at" = ?, "activo" = ? WHERE "productos"."id" = ?  [["created_at", "2019-06-22 22:19:34.334865"], ["updated_at", "2019-06-22 22:19:34.334865"], ["activo", 1], ["id", 2]]
UPDATE "facturas" SET "total" = ?, "updated_at" = ? WHERE "facturas"."id" = ?  [["total", 400], ["updated_at", "2019-06-26 01:35:51.462627"], ["id", 3]]